_Rarzrabotki/Rarus/USO2/Documents/УСОERP_НазначениеИсполнителейРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_НазначениеИсполнителейРабот</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УСОERP_НазначенияИсполнителейРабот</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУтверждения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_УтверждениеКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоставРесурса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СоставРесурсов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторДляПоиска</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоставРесурса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СоставРесурсов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторДляПоиска</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ВидыПланированияСтроительныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ВидыПланированияСтроительныхРабот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Календарный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месячный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НедельноСуточный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ВидыДнейПроизводственногоКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыДнейПроизводственногоКалендаря</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Суббота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воскресенье</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предпраздничный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Праздник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нерабочий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_СоставРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УСОERP_СоставРесурсов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Рабочие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Механизмы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипМеханизма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыТранспортныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Механизм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_НазначениеИсполнителейРабот/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

&НаКлиенте
Перем ПредыдущиеРеквизитыСтроки; //используется для отвязки строки поступления от строки заказа

&НаКлиенте
Перем ТекущиеДанныеИдентификатор; //используется для передачи текущей строки в обработчик ожидания

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;   
		
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	     		
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПриЧтенииСозданииНаСервере();
		
		Объект.ДатаНачала 		= НачалоНедели(ТекущаяДата());
		Объект.ДатаОкончания 	= КонецНедели(ТекущаяДата());
		
	КонецЕсли; 
	
	НовыйВариант = Объект.ДокументУтверждения.СценарийПланирования.НовыйВариант = Истина;
	
	ИнициализироватьТаблицуДатНазначений();
	ЗаполнитьДокумент();  	
	
	ТекущийОбъектСтроительства = Объект.ОбъектСтроительства;
	ТекущаяДатаНачала = Объект.ДатаНачала;
	ТекущаяДатаОкончания = Объект.ДатаОкончания;
	
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	
	 // СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды   
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	АктивнаяСтраница = Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя;
	
	РазвернутьДерево("ДеревоРабот");
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Обработчик механизма "ДатыЗапретаИзменения"
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	ПриЧтенииСозданииНаСервере();
	
		// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды  
	
	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 	

	ПоместитьРаботыИРесурсыВТабличнуюЧасть(ТекущийОбъект);
	ПоместитьНазначенияРаботВТабличнуюЧасть(ТекущийОбъект); 	

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства 	
	
	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);	

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_НазначениеИсполнителейРабот", ПараметрыЗаписи, Объект.Ссылка);

	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	//Элементы.ГруппаКомментарий.Картинка = ОбщегоНазначения.ПолучитьКартинкуКомментария(Объект.Комментарий);
	
	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбъектСтроительстваПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ТекущийОбъектСтроительства) Тогда
		Если ТекущийОбъектСтроительства <> Объект.ОбъектСтроительства 
			И (ТаблицаНазначений.Количество()>0
			ИЛИ ДеревоРабот.ПолучитьЭлементы().Количество()>0) Тогда
			
			ПоказатьВопрос(Новый ОписаниеОповещения("ОбъектСтроительстваПриИзмененииПродолжение",ЭтотОбъект),"Данные в табличных частях будут очищены. Продолжить?", РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет)
						
		Иначе
			
			ОбъектСтроительстваПриИзмененииПродолжение(КодВозвратаДиалога.Да,Новый Структура);

		КонецЕсли;	
		
	Иначе
		
		ОбъектСтроительстваПриИзмененииПродолжение(КодВозвратаДиалога.Да,Новый Структура);
	
	КонецЕсли;   
		
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСтроительстваПриИзмененииПродолжение(Ответ,ДопПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Объект.ОбъектСтроительства = ТекущийОбъектСтроительства;
		Возврат;
	КонецЕсли;
	
	ДеревоРабот.ПолучитьЭлементы().Очистить();
	ДеревоНазначений.ПолучитьЭлементы().Очистить();
	ТаблицаНазначений.Очистить();
	
	ИнициализироватьТаблицуДатНазначений();
	Если АктивнаяСтраница = "ГруппаИсполнители" Тогда
		СформироватьДеревоТаблицуНазначений();
	Иначе
		СформироватьДеревоТаблицуНазначений("ТаблицаНазначений");
	КонецЕсли;

	ТекущийОбъектСтроительства = Объект.ОбъектСтроительства;

	
КонецПроцедуры 

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	Если Объект.ДатаНачала = Дата("00010101") Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ДатаОкончания = Дата("00010101") Тогда	
		Возврат;
	КонецЕсли;
	
	Если Объект.ДатаНачала> Объект.ДатаОкончания Тогда
		Возврат;
	КонецЕсли;
	
	ИнициализироватьТаблицуДатНазначений();
	
	ЗаполнитьПоТабелю = Истина;
	Если ТаблицаНазначений.Количество()>0
		Или ДеревоНазначений.ПолучитьЭлементы().Количество()>0 тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ДатаНачалаПриИзмененииПродолжение",ЭтотОБъект),"Заполнить по умолчанию количество часов из графика рабочего времени?", РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет);
		
	Иначе
		
		ДатаНачалаПриИзмененииПродолжение(КодВозвратаДиалога.Да,Новый Структура);
		
	КонецЕсли;			
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзмененииПродолжение(Ответ,ДопПараметры)Экспорт
	
	ЗаполнитьПоТабелю = Ответ = КодВозвратаДиалога.Да;
	
	ЗаполнитьТаблицуНазначенийПриИзмененииПериода(ЗаполнитьПоТабелю);
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаИсполнители Тогда
		ЗаполнитьДеревоНазначенийПриСменеСтраницы(Истина,ЗаполнитьПоТабелю);
		РазвернутьДерево("ДеревоНазначений");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	Если Объект.ДатаНачала = Дата("00010101") Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ДатаОкончания = Дата("00010101") Тогда	
		Возврат;
	КонецЕсли;
	
	Если Объект.ДатаНачала> Объект.ДатаОкончания Тогда
		Возврат;
	КонецЕсли;
	
	ИнициализироватьТаблицуДатНазначений();
	
	ЗаполнитьПоТабелю = Истина;
	Если ТаблицаНазначений.Количество()>0
		Или ДеревоНазначений.ПолучитьЭлементы().Количество()>0 тогда
		
	ПоказатьВопрос(Новый ОписаниеОповещения("ДатаОкончанияПриИзмененииПродолжение",ЭтотОБъект),"Заполнить по умолчанию количество часов из графика рабочего времени?", РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет);
		 
	 Иначе
		 
		 ДатаОкончанияПриИзмененииПродолжение(КодВозвратаДиалога.Да,Новый Структура);
		 
	 КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзмененииПродолжение(Ответ,ДопПараметры) Экспорт
	
	ЗаполнитьПоТабелю = Ответ = КодВозвратаДиалога.Да;	 
			
	ЗаполнитьТаблицуНазначенийПриИзмененииПериода(ЗаполнитьПоТабелю);
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаИсполнители Тогда
		ЗаполнитьДеревоНазначенийПриСменеСтраницы(Истина,ЗаполнитьПоТабелю);
		РазвернутьДерево("ДеревоНазначений");
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовДереваФормыДеревоРабот

&НаКлиенте
Процедура ДеревоРаботПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоРабот.ТекущиеДанные;
	Если не ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные.ПолучитьЭлементы();
		Элементы.ТаблицаНазначений.ОтборСтрок = Новый ФиксированнаяСтруктура("Работа, Ресурс, ИдентификаторДляПоиска", ТекущиеДанные.Работа, ТекущиеДанные.Ресурс, ТекущиеДанные.ИдентификаторДляПоиска);
		УстановитьОформлениеКолонокПоРаботе(ТекущиеДанные.Работа);
	Иначе
		Элементы.ТаблицаНазначений.ОтборСтрок = Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоРаботПередУдалением(Элемент, Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ДеревоРабот.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
			
		Если ТекущиеДанные.ЭтоРабота Тогда
			СтрокиРесурсов = ТекущиеДанные.ПолучитьЭлементы();
			Для Каждого СтрРесурс Из СтрокиРесурсов Цикл
				ОбновитьНазначенияПередУдалением(СтрРесурс.ПолучитьИдентификатор());
			КонецЦикла;
		Иначе
			ОбновитьНазначенияПередУдалением(ТекущиеДанные.ПолучитьИдентификатор());
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеКолонокПоРаботе(Работа)
	
	Результат = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьПараметрыВыполненияРаботы(Работа, Перечисления.УСОERP_ВидыПланированияСтроительныхРабот.Календарный, ТекущаяДата(), Истина);
	
	Если Работа.Владелец.НовыйВариант Тогда
		Результат = ПараметрыВыполненияРаботы(Работа);
	КонецЕсли;
	
	Если ТипЗнч(Результат.НачалоРаботыПлан) = Тип("Дата") И ТипЗнч(Результат.ОкончаниеРаботыПлан) = Тип("Дата") И ТипЗнч(Объект.ДатаНачала) = Тип("Дата") Тогда
		
		НачалоРаботы 	= НачалоДня(Результат.НачалоРаботыПлан);
		ОкончаниеРаботы = НачалоДня(Результат.ОкончаниеРаботыПлан);
		НачалоПериода 	= НачалоДня(Объект.ДатаНачала);
		
		УстановитьУсловноеОформление();

		Пока НачалоПериода <= Объект.ДатаОкончания Цикл
			Если НачалоРаботы <= НачалоПериода И НачалоПериода <= ОкончаниеРаботы Тогда
				ТекКолонка = Элементы.ТаблицаНазначений.ПодчиненныеЭлементы.Найти("ТаблицаНазначенийДата" + Формат(НачалоПериода, "ДФ=ddMMyyyy"));
				Если ТекКолонка <> Неопределено 
					И ТекКолонка.ЦветФона <> ЦветаСтиля.ПолеСОшибкойФон Тогда

					Элемент = УсловноеОформление.Элементы.Добавить();
					
					ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
					ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТаблицаНазначенийДата" + Формат(НачалоПериода, "ДФ=ddMMyyyy"));
					Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаПолностьюОбеспечен);

				КонецЕсли;
			КонецЕсли;
			НачалоПериода = НачалоПериода + 60 * 60 * 24;
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыВыполненияРаботы(Работа) 	
	
	СтруктураВозврата = Новый Структура; 	
	
	СтруктураВозврата.Вставить("Ссылка",Работа);
	СтруктураВозврата.Вставить("Владелец",Работа.Владелец);
	СтруктураВозврата.Вставить("СценарийПланирования",Работа.Владелец);
	СтруктураВозврата.Вставить("ОбъектСтроительства",Работа.Владелец.Владелец);
	СтруктураВозврата.Вставить("Родитель",Работа.Родитель);
	СтруктураВозврата.Вставить("СуммарнаяРабота",Работа.СуммарнаяРабота);
	СтруктураВозврата.Вставить("ГрафикРаботы",Работа.ГрафикРаботы);
	СтруктураВозврата.Вставить("НачалоРаботыПлан",Работа.ДатаНачала);
	СтруктураВозврата.Вставить("ОкончаниеРаботыПлан",Работа.ДатаОкончания);
	СтруктураВозврата.Вставить("ДлительностьПлан",Работа.Длительность);
	СтруктураВозврата.Вставить("ЕдиницаДлительности",Работа.ЕдиницаДлительности);
	СтруктураВозврата.Вставить("ОбъемРаботы",Работа.ОбъемРаботы);
	СтруктураВозврата.Вставить("ЕдиницаОбъема",Работа.ЕдиницаОбъема);
	СтруктураВозврата.Вставить("Утверждена",Истина);
	СтруктураВозврата.Вставить("ВидПланирования",Перечисления.УСОERP_ВидыПланированияСтроительныхРабот.Календарный);  
	СтруктураВозврата.Вставить("КритическаяРабота",Работа.КритическаяРабота);  	
	
	Возврат СтруктураВозврата;  	
	
КонецФункции

&НаКлиенте
Процедура ДеревоРаботСоставРесурсаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоРабот.ТекущиеДанные;
	ТекущиеДанные.ПолучитьЭлементы();
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Ресурс) Тогда
		СтандартнаяОбработка = Ложь;
		
		ОткрытьФорму("Справочник.УСОERP_СоставРесурсов.ФормаВыбора", Новый Структура("Ресурс", ТекущиеДанные.Ресурс), Элемент);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРаботСоставРесурсаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоРабот.ТекущиеДанные;
	
	ЗаполнитьТаблицуНазначений(Ложь, ТекущиеДанные.ПолучитьИдентификатор());

	//РазвернутьДерево("ДеревоНазначений");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ТаблицаНазначенийКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаНазначений.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ПолучитьИтогПоСтрокеНазначения(ТекущиеДанные.ПолучитьИдентификатор());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДеревоНазначенийКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоНазначений.ТекущиеДанные;
		
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		ТекущиеДанные.ПолучитьЭлементы();
		Родитель = ТекущиеДанные.ПолучитьРодителя();
		СтрокиРабот = Родитель.ПолучитьЭлементы();
		
		КоличествоОбщее = 0;
		Для Каждого СтрокаДата из ТаблицаДнейНазначений Цикл
			КоличествоОбщее = КоличествоОбщее + ТекущиеДанные[СтрокаДата.ИмяКолонки];
		КонецЦикла;
		ТекущиеДанные.КоличествоОбщее = КоличествоОбщее;
		
		ИтогоКоличествоОбщее = 0;
		ИтогоЗаДень 		 = 0;
		
		ИмяКолонки = СтрЗаменить(Элемент.Имя, "ДеревоНазначений", "");
		
		Для Каждого СтрокаРабота Из СтрокиРабот Цикл
			ИтогоКоличествоОбщее = ИтогоКоличествоОбщее + СтрокаРабота.КоличествоОбщее;
			ИтогоЗаДень 		 = ИтогоЗаДень + СтрокаРабота[ИмяКолонки];
		КонецЦикла;
		
		Родитель.КоличествоОбщее = ИтогоКоличествоОбщее;
		Родитель[ИмяКолонки]	 = ИтогоЗаДень;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьИтогПоСтрокеНазначения(ИдентификаторСтроки)
	
	ТекущаяСтрока = ТаблицаНазначений.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоИтог = 0;
	Для Каждого ЭлтДата Из ТаблицаДнейНазначений Цикл
		КоличествоИтог = КоличествоИтог + ТекущаяСтрока[ЭлтДата.ИмяКолонки];
	КонецЦикла;
	ТекущаяСтрока.КоличествоОбщее = КоличествоИтог;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ПараметрыОткрытия 	= Новый Структура("НачалоПериода, КонецПериода", Объект.ДатаНачала, Объект.ДатаОкончания);
	ОписаниеОповещения 	= Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыОткрытия, Элементы.ВыбратьПериод, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Объект.ДатаНачала = РезультатВыбора.НачалоПериода;
	Объект.ДатаОкончания = КонецДня(РезультатВыбора.КонецПериода);
	ТекущаяДатаНачала = Объект.ДатаНачала;
	ТекущаяДатаОкончания = Объект.ДатаОкончания;
	
	ИнициализироватьТаблицуДатНазначений();
	
	ЗаполнитьПоТабелю = Истина;
	Если ТаблицаНазначений.Количество()>0
		Или ДеревоНазначений.ПолучитьЭлементы().Количество()>0 тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ДатаОкончанияПриИзмененииПродолжение",ЭтотОБъект),"Заполнить по умолчанию количество часов из графика рабочего времени?", РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет);
		 
	 Иначе
		 
		 ДатаОкончанияПриИзмененииПродолжение(КодВозвратаДиалога.Да,Новый Структура);
		 
	 КонецЕсли;  
	 
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРесурсы(Команда)
	
	Если  ТаблицаНазначений.Количество() Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьРесурсыПродолжение",ЭтотОбъект),"Назначения исполнителей будут очищены. Продолжить?", РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет);
		
	Иначе
		
		ЗаполнитьРесурсыПродолжение(КодВозвратаДиалога.Да,Новый Структура);  		
		
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРесурсыПродолжение(Ответ,ДопПараметры)Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРесурсыНаСервере();
	Модифицированность = Истина;
	
	РазвернутьДерево("ДеревоРабот"); 	
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьРесурсыНаСервере()
	
	УСОERP_ЗащищенныеФункцииСервер.УСОERP_НазначениеИсполнителейРабот_ЗаполнитьТаблицуРаботИРесурсов(ЭтотОбъект);
	СформироватьИЗаполнитьДеревоРаботИРесурсов();
	
	ЗаполнитьТаблицуНазначений(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуНазначенийПоГрафику(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьТаблицуНазначенийПоГрафикуПродолжение",ЭтотОбъект),"По всем исполнителям текущие данные будут перезаполнены. Продолжить?", РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуНазначенийПоГрафикуПродолжение(Ответ,ДопПараметры)Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;  	
	
	ЗаполнитьТаблицуНазначений(,,Истина);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуНазначенийПоГрафикуДляВыделенныхСтрок(Команда)
	
	Если Элементы.ТаблицаНазначений.ВыделенныеСтроки.Количество() > 0 Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьТаблицуНазначенийПоГрафикуДляВыделенныхСтрокПродолжение",ЭтотОбъект),"По всем  указанным исполнителям текущие данные будут перезаполнены. Продолжить?", РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуНазначенийПоГрафикуДляВыделенныхСтрокПродолжение(Ответ,ДопПараметры)Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ВыделеннаяСтрока Из Элементы.ТаблицаНазначений.ВыделенныеСтроки Цикл
			ЗаполнитьЧасыИсполнителейПоТабелю(ВыделеннаяСтрока);
	КонецЦикла;
	
	Модифицированность = Истина;
	 
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуНазначенийПоГрафикуДляСоставаРесурса(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаНазначений.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивИдентификаторовСтрок = ПолучитьМассивИдентификаторовСтрокСОтборомПоРесурсуиСоставу(ТекущиеДанные.ПолучитьИдентификатор());
	
	Если МассивИдентификаторовСтрок.Количество() > 0 Тогда
		
		СтруктураПараметров = Новый Структура("МассивИдентификаторовСтрок",МассивИдентификаторовСтрок);
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьТаблицуНазначенийПоГрафикуДляСоставаРесурсаПродолжение",ЭтотОбъект,СтруктураПараметров),"По всем  указанным исполнителям текущие данные будут перезаполнены. Продолжить?", РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуНазначенийПоГрафикуДляСоставаРесурсаПродолжение(Ответ,ДопПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	МассивИдентификаторовСтрок = ДопПараметры.МассивИдентификаторовСтрок;
	Для Каждого ИдентификаторСтроки Из МассивИдентификаторовСтрок Цикл
		ЗаполнитьЧасыИсполнителейПоТабелю(ИдентификаторСтроки);
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры    

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРабот.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРабот.ЭтоРабота");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(WindowsШрифты.ШрифтДиалоговИМеню,,,Истина));
		
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРаботСоставРесурса.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРабот.ЭтоРабота");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр",Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "-");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);

	//

    Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРаботРаботаКодСДР.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРабот.ЭтоРабота");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "");

	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоНазначений.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоНазначений.Работа");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(WindowsШрифты.ШрифтДиалоговИМеню,,,Истина));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаГруппировкиОтчета2);

	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоНазначенийДолжность.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоНазначений.Работа");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "");
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	//Элементы.ГруппаКомментарий.Картинка = ОбщегоНазначения.ПолучитьКартинкуКомментария(Объект.Комментарий);
	
КонецПроцедуры	

#КонецОбласти

#Область Прочее

&НаСервере
Процедура ИнициализироватьТаблицуДатНазначений()
	
	ТаблицаДат = ТаблицаДнейНазначений.Выгрузить();
	ТаблицаДат.Очистить();
	
	мДатаНачала = НачалоДня(Объект.ДатаНачала);
	мДатаОкончания = КонецДня(Объект.ДатаОкончания);
	
	ДатаЗаголовка = мДатаНачала;
	
	мПроизводственныйКалендарь = Объект.ОбъектСтроительства.ГрафикРаботы.ПроизводственныйКалендарь;
	ДанныеПроизводственногоКалендаря = Справочники.ПроизводственныеКалендари.ДанныеПроизводственногоКалендаря(мПроизводственныйКалендарь, Год(Объект.ДатаНачала));
	Если НЕ Год(Объект.ДатаНачала) = Год(Объект.ДатаОкончания) Тогда
		ДанныеПроизводственногоКалендаря2 = Справочники.ПроизводственныеКалендари.ДанныеПроизводственногоКалендаря(мПроизводственныйКалендарь, Год(Объект.ДатаОкончания));
	КонецЕсли;
	
	Пока ДатаЗаголовка<= мДатаОкончания Цикл
		НоваяСтрока = ТаблицаДат.Добавить();
		
		НоваяСтрока.Дата 				= НачалоДня(ДатаЗаголовка);
		НоваяСтрока.ИмяКолонки 			= "Дата" + СтрЗаменить(Формат(ДатаЗаголовка, "ДФ=dd.MM.yyyy"), ".", "");
		НоваяСтрока.ЗаголовокКолонки 	= Формат(ДатаЗаголовка, "ДФ=dd.MM");
		ДатаЗаголовка = ДатаЗаголовка + 86400;
		
		ДанныеПоКалендарю = ДанныеПроизводственногоКалендаря.НайтиСтроки(Новый Структура("Дата", НоваяСтрока.Дата));
		Если ДанныеПоКалендарю.Количество()>0 Тогда
			НоваяСтрока.ВидДня = ДанныеПоКалендарю[0].ВидДня;
		КонецЕсли;

		Если НЕ Год(Объект.ДатаНачала) = Год(Объект.ДатаОкончания) 
			И Год(Объект.ДатаОкончания) = Год(НоваяСтрока.Дата) Тогда
			ДанныеПоКалендарю = ДанныеПроизводственногоКалендаря.НайтиСтроки(Новый Структура("Дата", НоваяСтрока.Дата));
			Если ДанныеПоКалендарю.Количество()>0 Тогда
				НоваяСтрока.ВидДня = ДанныеПоКалендарю[0].ВидДня;
			КонецЕсли;
		КонецЕсли;
						
	КонецЦикла;
	
	ТаблицаДнейНазначений.Загрузить(ТаблицаДат);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокумент()
	
	СформироватьИЗаполнитьДеревоРаботИРесурсов();
		
	СформироватьДеревоТаблицуНазначений("ТаблицаНазначений");
	
	ЗаполнитьТаблицуНазначений(Истина);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьИЗаполнитьДеревоРаботИРесурсов()
	
	мДеревоРесурсов = РеквизитФормыВЗначение("ДеревоРабот", Тип("ДеревоЗначений"));
	мДеревоРесурсов.Строки.Очистить();
	
	ТаблицаРаботИРесурсов = Объект.Работы.Выгрузить();
	ТаблицаРабот = ТаблицаРаботИРесурсов.Скопировать();
	ТаблицаРабот.Свернуть("Работа");
	
	ДанныеДляДерева = Новый ДеревоЗначений;
	ТипыЗначений = Новый Массив; 
    ТипыЗначений.Добавить(Тип("СправочникСсылка.УСОERP_Ресурсы")); 
    ТипыЗначений.Добавить(Тип("СправочникСсылка.УСОERP_СтроительныеРаботы")); 
	ДанныеДляДерева.Колонки.Добавить("РаботаРесурс",           Новый ОписаниеТипов(ТипыЗначений));		
	ДанныеДляДерева.Колонки.Добавить("Работа",                 Новый ОписаниеТипов(ТипыЗначений));		
	ДанныеДляДерева.Колонки.Добавить("РаботаРодитель",         Новый ОписаниеТипов(ТипыЗначений));		
	ДанныеДляДерева.Колонки.Добавить("КодСДР",                 Новый ОписаниеТипов("Строка"));		
	ДанныеДляДерева.Колонки.Добавить("НомерРаботыВУровне",     Новый ОписаниеТипов("Число"));		
	ДанныеДляДерева.Колонки.Добавить("КодСДРЧисло",            Новый ОписаниеТипов("Число"));		
	
	ДанныеДляДерева.Колонки.Добавить("СоставРесурса",          Новый ОписаниеТипов("СправочникСсылка.УСОERP_СоставРесурсов"));		
	ДанныеДляДерева.Колонки.Добавить("Ресурс",                 Новый ОписаниеТипов("СправочникСсылка.УСОERP_Ресурсы"));		
	ДанныеДляДерева.Колонки.Добавить("ЭтоРабота",              Новый ОписаниеТипов("Булево"));		
	ДанныеДляДерева.Колонки.Добавить("ИдентификаторДляПоиска", Новый ОписаниеТипов("число"));		
	
	Для Каждого СтрокаРабота Из ТаблицаРабот Цикл
		НоваяСтрока_Работа                    = ДанныеДляДерева.Строки.Добавить();
		НоваяСтрока_Работа.Работа             = СтрокаРабота.Работа;
		НоваяСтрока_Работа.РаботаРесурс       = СтрокаРабота.Работа;
		НоваяСтрока_Работа.ЭтоРабота          = Истина;
		НоваяСтрока_Работа.РаботаРодитель     = Справочники.УСОERP_СтроительныеРаботы.ПустаяСсылка();
		НоваяСтрока_Работа.КодСДР             = СтрокаРабота.Работа.КодСДР;
		НоваяСтрока_Работа.НомерРаботыВУровне = СтрокаРабота.Работа.НомерРаботыВУровне;
		
		МассивРесурсов = ТаблицаРаботИРесурсов.НайтиСтроки(Новый Структура("Работа", СтрокаРабота.Работа));
		Для Каждого СтрокаРесурс Из  МассивРесурсов Цикл
			НоваяСтрока_Ресурс                = НоваяСтрока_Работа.Строки.Добавить();
			ЗаполнитьЗначенияСвойств            (НоваяСтрока_Ресурс,  СтрокаРесурс);
			//НоваяСтрока_Ресурс.Работа         = СтрокаРесурс.Ресурс;
			НоваяСтрока_Ресурс.РаботаРодитель = НоваяСтрока_Работа.Работа;
			НоваяСтрока_Ресурс.РаботаРесурс   = СтрокаРесурс.Ресурс;
		КонецЦикла;
	КонецЦикла;
	
	//ВыражениеИсточник = "Работа";
	//ВыражениеПриемник = "РаботаРодитель" ;
	//Справочник        = Справочники.УСОERP_СтроительныеРаботы;
	//ДеревоРезультат   = УСОERP_ОбработкаТабличныхЧастей.УСОERP_ПодготовитьДанныеИСформироватьДерево(ДанныеДляДерева,ВыражениеИсточник, ВыражениеПриемник, Справочник);	
	//
	//ВремРодноеДерево = РеквизитФормыВЗначение("ДеревоРабот"); // берется родная структура с родной типизацией
	//ВремРодноеДерево.Строки.Очистить();
	//УСОERP_ОбработкаТабличныхЧастей.УСОERP_ЗаполнитьРоднуюСтруктуруДереваИзВнешнего(ВремРодноеДерево.Строки, ДеревоРезультат.Строки); // и рекурсивно заполняется из дерева, где, возможн, типиация создаст проблемы
	//ЗначениеВРеквизитФормы(ВремРодноеДерево, "ДеревоРабот");
	//ВремРодноеДерево.Строки.Очистить(); // уборка за собой

	ЗначениеВРеквизитФормы(ДанныеДляДерева, "ДеревоРабот");
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДеревоТаблицуНазначений(ИмяТаблицы = "")
	
	Если ИмяТаблицы = "" Тогда
		ИмяТаблицы = "ДеревоНазначений";
	Конецесли;
	 
	ДобавляемыеКолонки = Новый Массив();
	УдаляемыеКолонки   = Новый Массив();
	УдаляемыеЭлементы  = Новый Массив();
	УсловныеОформления = Новый Массив();
	
	Если ИмяТаблицы = "" Тогда
		ДеревоЗначений = Новый ДеревоЗначений;
	Иначе
		ДеревоЗначений = Новый ТаблицаЗначений;
	КонецЕсли;
  
	ДеревоЗначений.Колонки.Добавить("Работа",             	Новый ОписаниеТипов("СправочникСсылка.УСОERP_СтроительныеРаботы"));
	ДеревоЗначений.Колонки.Добавить("Ресурс",             	Новый ОписаниеТипов("СправочникСсылка.УСОERP_Ресурсы"));
	ДеревоЗначений.Колонки.Добавить("СоставРесурса",      	Новый ОписаниеТипов("СправочникСсылка.УСОERP_СоставРесурсов"));
	ДеревоЗначений.Колонки.Добавить("Сотрудник",        	Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ДеревоЗначений.Колонки.Добавить("Должность",        	Новый ОписаниеТипов("СправочникСсылка.Должности"));
	ДеревоЗначений.Колонки.Добавить("РеквизитСортировки", 	Новый ОписаниеТипов("Число"));
	ДеревоЗначений.Колонки.Добавить("КоличествоОбщее", Новый ОписаниеТипов("Число"));

	//Если ИмяТаблицы = "ТаблицаНазначений" Тогда
		ДеревоЗначений.Колонки.Добавить("ИдентификаторДляПоиска", Новый ОписаниеТипов("Число"));
	//КонецЕсли;
	
	
	Если ИмяТаблицы = "ДеревоНазначений" Тогда
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("СправочникСсылка.Сотрудники"));
		МассивТипов.Добавить(Тип("СправочникСсылка.УСОERP_СтроительныеРаботы"));
		ДеревоЗначений.Колонки.Добавить("ИсполнительРабота", Новый ОписаниеТипов(МассивТипов));
	КонецЕсли;
	
	
	
	Для Каждого СтрокаДата Из ТаблицаДнейНазначений Цикл 		
		ИмяКолонки = СтрокаДата.ИмяКолонки; 		
		ДеревоЗначений.Колонки.Добавить( ИмяКолонки, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный)), Формат(СтрокаДата.Дата,"ДФ='dd.MM'"));		
	КонецЦикла;

	РеквизитыТаблицы = ПолучитьРеквизиты(ИмяТаблицы);
	Для Каждого Реквизит Из РеквизитыТаблицы Цикл
		Если Найти(Реквизит.Имя, "Дата") ИЛИ Найти(Реквизит.Имя, "КоличествоОбщее") Тогда
			УдаляемыеКолонки.Добавить(ИмяТаблицы + "." + Реквизит.Имя);
		КонецЕсли;
	КонецЦикла;

	Для Каждого Колонка Из ДеревоЗначений.Колонки Цикл
		
		Если Найти(Колонка.Имя, "Дата") ИЛИ Найти(Колонка.Имя, "КоличествоОбщее") Тогда
			УдаляемаяКолонка = УдаляемыеКолонки.Найти(ИмяТаблицы + "." + Колонка.Имя);
			Если УдаляемаяКолонка <> Неопределено Тогда
				УдаляемыеКолонки.Удалить(УдаляемаяКолонка);
			Иначе
				ДобавляемыеКолонки.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, ИмяТаблицы, Колонка.Заголовок, Истина));
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;
	
	Если УдаляемыеКолонки.Количество() > 0 Или ДобавляемыеКолонки.Количество() > 0 Тогда
		ИзменитьРеквизиты(ДобавляемыеКолонки, УдаляемыеКолонки);
	КонецЕсли;
	
	Для Каждого ТекЭлемент Из Элементы[ИмяТаблицы].ПодчиненныеЭлементы Цикл
		Если Найти(ТекЭлемент.Имя, "Дата")
			ИЛИ Найти(ТекЭлемент.Имя, "КоличествоОбщее") Тогда
			УдаляемыеЭлементы.Добавить(ТекЭлемент);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого УдаляемыйЭлемент Из УдаляемыеЭлементы Цикл
		Элементы.Удалить(УдаляемыйЭлемент);
	КонецЦикла;
	
	ШиринаКолонки = ?(ТаблицаДнейНазначений.Количество()>10, 6, 12);
	НовоеПоле = ДобавитьПолеФормы(ЭтаФорма,ИмяТаблицы, "КоличествоОбщее", "Итого", , , ШиринаКолонки, ЦветаСтиля.ЦветФонаГруппировкиОтчета2, ,,,,, Истина );	
	НовоеПоле.ФиксацияВТаблице = ФиксацияВТаблице.Лево;
	
	Для Каждого СтрокаДата Из ТаблицаДнейНазначений Цикл
		
		ИмяКолонки = СтрокаДата.ИмяКолонки; 
		Если ЗначениеЗаполнено(СтрокаДата.ВидДня) Тогда
			Если СтрокаДата.ВидДня <> Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий
				И СтрокаДата.ВидДня <> Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный Тогда
				НовоеПоле = ДобавитьПолеФормы(ЭтаФорма,ИмяТаблицы, ИмяКолонки, Формат(СтрокаДата.Дата,"ДФ='dd.MM'"), "Подключаемый_" + ИмяТаблицы + "КоличествоПриИзменении", , ШиринаКолонки, ЦветаСтиля.ПолеСОшибкойФон, , WebЦвета.Красный,,,,,, Ложь);
			Иначе
				НовоеПоле = ДобавитьПолеФормы(ЭтаФорма,ИмяТаблицы, ИмяКолонки, Формат(СтрокаДата.Дата,"ДФ='dd.MM'"), "Подключаемый_" + ИмяТаблицы + "КоличествоПриИзменении", , ШиринаКолонки, , , ,,,,,, Ложь);
			КонецЕсли;
		Иначе
			Если ДеньНедели(СтрокаДата.Дата) = 6
				ИЛИ ДеньНедели(СтрокаДата.Дата) = 7 Тогда
				НовоеПоле = ДобавитьПолеФормы(ЭтаФорма,ИмяТаблицы, ИмяКолонки, Формат(СтрокаДата.Дата,"ДФ='dd.MM'"), "Подключаемый_" + ИмяТаблицы + "КоличествоПриИзменении", , ШиринаКолонки, ЦветаСтиля.ПолеСОшибкойФон, , WebЦвета.Красный,,,,,, Ложь);
			Иначе
				НовоеПоле = ДобавитьПолеФормы(ЭтаФорма,ИмяТаблицы, ИмяКолонки, Формат(СтрокаДата.Дата,"ДФ='dd.MM'"), "Подключаемый_" + ИмяТаблицы + "КоличествоПриИзменении", , ШиринаКолонки, , , ,,,,,, Ложь);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	
		
	ДеревоНазначенийЗначение = РеквизитФормыВЗначение(ИмяТаблицы);
	ДеревоНазначенийЗначение.Колонки.Очистить();
	
	Для Каждого Колонка Из ДеревоЗначений.Колонки Цикл
		ДеревоНазначенийЗначение.Колонки.Добавить(Колонка.Имя);
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоНазначенийЗначение, ИмяТаблицы); 

КонецПроцедуры

&НаСервере
Функция ДобавитьПолеФормы(Форма,
						  ИмяТаблицы,
	                      Имя,
						  Заголовок = Неопределено,
						  ОбработчикПриИзменении = "",
						  ОбработчикНачалоВыбора = "",
						  ШиринаПоля,
						  ЦветФона = Неопределено,
						  ЦветФонаЗаголовка = Неопределено,
						  ЦветТекстаЗаголовка = Неопределено,
						  Родитель = Неопределено,
						  КартинкаШапки = Неопределено,
						  ПутьКДанным = Неопределено,
						  ТолькоПросмотрПоля = Ложь,
						  СвязиПараметровВыбора = Неопределено,
						  РастягиватьПоГоризонтали = Неопределено)
	
	НовоеПоле                     = Форма.Элементы.Добавить(ИмяТаблицы + Имя, Тип("ПолеФормы"), ?(Родитель = Неопределено, Форма.Элементы[ИмяТаблицы], Родитель));
	НовоеПоле.ПутьКДанным         = ?(ЗначениеЗаполнено(ПутьКДанным), ПутьКДанным, ИмяТаблицы + "." + Имя);
	НовоеПоле.Заголовок           = ?(ЗначениеЗаполнено(Заголовок), Заголовок, Имя);
	НовоеПоле.РежимРедактирования = РежимРедактированияКолонки.ВходПриВводе;
	НовоеПоле.Вид                 = ВидПоляФормы.ПолеВвода;
	НовоеПоле.ТолькоПросмотр      = ТолькоПросмотрПоля;
	НовоеПоле.Ширина              = ШиринаПоля;
	
	НовоеПоле.РастягиватьПоГоризонтали = Ложь;
	
	Если СвязиПараметровВыбора <> Неопределено Тогда
		НовоеПоле.СвязиПараметровВыбора = СвязиПараметровВыбора;
	КонецЕсли;
	
	Если ЦветФонаЗаголовка <> Неопределено Тогда
		НовоеПоле.ЦветФонаЗаголовка = ЦветФонаЗаголовка;
	КонецЕсли;
	
	Если ЦветФона <> Неопределено Тогда
		НовоеПоле.ЦветФона = ЦветФона;
	КонецЕсли;
	
	Если ЦветТекстаЗаголовка <> Неопределено Тогда
		НовоеПоле.ЦветТекстаЗаголовка = ЦветТекстаЗаголовка;
	КонецЕсли;
	
	Если КартинкаШапки <> Неопределено Тогда
		НовоеПоле.КартинкаШапки = КартинкаШапки;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ОбработчикПриИзменении) Тогда
		НовоеПоле.УстановитьДействие("ПриИзменении", ОбработчикПриИзменении);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбработчикНачалоВыбора) Тогда
		НовоеПоле.УстановитьДействие("НачалоВыбора", ОбработчикНачалоВыбора);
	КонецЕсли;
	
	Если РастягиватьПоГоризонтали <> Неопределено Тогда
		НовоеПоле.РастягиватьПоГоризонтали = РастягиватьПоГоризонтали;
	КонецЕсли;
	
	Возврат НовоеПоле;
	
КонецФункции

&НаКлиенте
Процедура РазвернутьДерево(ИмяДерева)
	
	КоллекцияЭлементовДерева = ЭтотОбъект[ИмяДерева].ПолучитьЭлементы();	
	//Развернуть дерево 
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
		ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
		Элементы[ИмяДерева].Развернуть(ИдентификаторСтроки);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДеньНедели(мДата)
	
	ДеньНедели = ДеньНедели(мДата);
	Если ДеньНедели = 1 Тогда
		Возврат "Пн.";
	ИначеЕсли ДеньНедели = 2 Тогда
		Возврат "Вт.";
	ИначеЕсли ДеньНедели = 3 Тогда
		Возврат "Ср.";
	ИначеЕсли ДеньНедели = 4 Тогда
		Возврат "Чт.";
	ИначеЕсли ДеньНедели = 5 Тогда
		Возврат "Пт.";
	ИначеЕсли ДеньНедели = 6 Тогда
		Возврат "Сб.";
	ИначеЕсли ДеньНедели = 7 Тогда
		Возврат "Вс.";
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуНазначений(ЧтениеИзТабличнойЧасти = Ложь, ИденфикаторСтроки = Неопределено, ЗаполнитьПоТабелю = Истина)
	
	УСОERP_ЗащищенныеФункцииСервер.УСОERP_НазначениеИсполнителейРабот_ЗаполнитьТаблицуНазначений(ЭтотОбъект, ЧтениеИзТабличнойЧасти, ИденфикаторСтроки, ЗаполнитьПоТабелю);
	
КонецПроцедуры

&НаСервере
Процедура ПоместитьРаботыИРесурсыВТабличнуюЧасть(ТекущийОбъект)
	
	мДеревоРаботИРесурсов = РеквизитФормыВЗначение("ДеревоРабот", Тип("ДеревоЗначений"));
	ТекущийОбъект.Работы.Очистить();
	Для Каждого СтрокаРабота Из мДеревоРаботИРесурсов.Строки Цикл
		Для Каждого СтрокаРесурс Из СтрокаРабота.Строки Цикл
			НоваяСтрока = ТекущийОбъект.Работы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРесурс);
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ПоместитьНазначенияРаботВТабличнуюЧасть(ТекущийОбъект)
	
	ТекущийОбъект.Исполнители.Очистить();
	
	Если АктивнаяСтраница = "ГруппаИсполнители" Тогда
		мДеревоНазначений = РеквизитФормыВЗначение("ДеревоНазначений", Тип("ДеревоЗначений"));
		Для Каждого СтрокаСотрудник Из мДеревоНазначений.Строки Цикл
			Для Каждого СтрокаРесурс Из СтрокаСотрудник.Строки Цикл
				Для Каждого СтрокаДата из ТаблицаДнейНазначений Цикл
					НоваяСтрока = ТекущийОбъект.Исполнители.Добавить();
					
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРесурс);
					НоваяСтрока.Дата = НачалоДня(СтрокаДата.Дата);
					НоваяСтрока.КоличествоЧасов = СтрокаРесурс[СтрокаДата.ИмяКолонки];
					
				КонецЦикла;
				
			КонецЦикла;
		КонецЦикла;
		
	Иначе
		
		Для Каждого СтрокаНазначение Из ТаблицаНазначений Цикл
			
			Для Каждого СтрокаДата из ТаблицаДнейНазначений Цикл
				НоваяСтрока = ТекущийОбъект.Исполнители.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНазначение);
				НоваяСтрока.Дата = НачалоДня(СтрокаДата.Дата);
				НоваяСтрока.КоличествоЧасов = СтрокаНазначение[СтрокаДата.ИмяКолонки];
				
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНазначенийПриИзмененииПериода(ЗаполнитьПоТабелю = Ложь);
	
	ТаблицаТекущихНазначений = ТаблицаНазначений.Выгрузить();
	
	СформироватьДеревоТаблицуНазначений("ТаблицаНазначений");
	ЗаполнитьТаблицуНазначений(,, ЗаполнитьПоТабелю);
	
	Если Не ЗаполнитьПоТабелю Тогда
		Для Каждого СтрокаТЗ Из ТаблицаТекущихНазначений Цикл
			
			СтруктураПоиска = Новый Структура("Работа, Ресурс, СоставРесурса, Сотрудник, Должность", СтрокаТЗ.Работа, СтрокаТЗ.Ресурс, СтрокаТЗ.СоставРесурса, СтрокаТЗ.Сотрудник, СтрокаТЗ.Должность);
			МассивСтрок = ТаблицаНазначений.НайтиСтроки(СтруктураПоиска);
			Для Каждого СтрокаМассива Из МассивСтрок Цикл
				ЗаполнитьЗначенияСвойств(СтрокаМассива, СтрокаТЗ); 
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если АктивнаяСтраница = "ГруппаРаботы" Тогда
		СформироватьДеревоТаблицуНазначений();
		ЗаполнитьДеревоНазначенийПриСменеСтраницы();  
		Если ТекущаяСтраница = Элементы.ГруппаИсполнители Тогда
			РазвернутьДерево("ДеревоНазначений"); 
		КонецЕсли;
	ИначеЕсли АктивнаяСтраница = "ГруппаИсполнители" Тогда
		СформироватьДеревоТаблицуНазначений("ТаблицаНазначений");
		ЗаполнитьТаблицуНазначенийПриСменеТаблицы();
	КонецЕсли;
	
	АктивнаяСтраница = ТекущаяСтраница.Имя; 
	
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоНазначенийПриСменеСтраницы(СменаПериода = Ложь, ЗаполнитьПоТабелю = Истина)
	
	Если СменаПериода Тогда
		мДеревоНазначенийТекущее = РеквизитФормыВЗначение("ДеревоНазначений", Тип("ДеревоЗначений"));
		
		СформироватьДеревоТаблицуНазначений();
		
		мДеревоНазначений = РеквизитФормыВЗначение("ДеревоНазначений", Тип("ДеревоЗначений"));
		
		Для Каждого СтрокаСотрудник Из мДеревоНазначенийТекущее.Строки Цикл
			СтрокаДерева_Сотрудник = мДеревоНазначений.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДерева_Сотрудник, СтрокаСотрудник);
			СтрокаДерева_Сотрудник.ИсполнительРабота = СтрокаСотрудник.Сотрудник;
			
			ТаблицаИтоговПоСотруднику = Новый ТаблицаЗначений;
			ТаблицаИтоговПоСотруднику.Колонки.Добавить("ИмяКолонки", Новый ОписаниеТипов("Строка"));
			ТаблицаИтоговПоСотруднику.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));

			Для Каждого СтрокаРесурс Из СтрокаСотрудник.Строки Цикл
				СтрокаДерева_Ресурс =  СтрокаДерева_Сотрудник.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДерева_Ресурс, СтрокаРесурс); 
				СтрокаДерева_Ресурс.ИсполнительРабота = СтрокаРесурс.Работа;
				
				Если ЗаполнитьПоТабелю Тогда
					СписокСотрудников = Новый Массив;
					СписокСотрудников.Добавить(СтрокаДерева_Ресурс.Сотрудник);
					
					ВыборкаДанныхОВремени = Документы.УСОERP_НазначениеИсполнителейРабот.ДанныеОВремениСотрудников(Объект, СписокСотрудников);
					
					ИтогоПоСортуднику = 0;
					Пока ВыборкаДанныхОВремени.СледующийПоЗначениюПоля("Сотрудник") Цикл
						Пока ВыборкаДанныхОВремени.СледующийПоЗначениюПоля("Дата") Цикл 								
							МассивСтрокДат = ТаблицаДнейНазначений.НайтиСтроки(Новый Структура("Дата", ВыборкаДанныхОВремени.Дата));
							Если МассивСтрокДат.Количество() <> 0 Тогда 
								ИмяКолонки = МассивСтрокДат[0].ИмяКолонки;  								
								СтрокаДерева_Ресурс[ИмяКолонки] = ВыборкаДанныхОВремени.НормаЧасов; 						
							КонецЕсли; 								
						КонецЦикла;	   							
					КонецЦикла;	
				КонецЕсли;
				
				КоличествоОбщее = 0;
				Для Каждого СтрокаДата Из ТаблицаДнейНазначений Цикл
					НоваяСтрокаИтог = ТаблицаИтоговПоСотруднику.Добавить();
					НоваяСтрокаИтог.ИмяКолонки = СтрокаДата.ИмяКолонки; 
					НоваяСтрокаИтог.Количество = СтрокаДерева_Ресурс[СтрокаДата.ИмяКолонки];
					КоличествоОбщее = КоличествоОбщее + СтрокаДерева_Ресурс[СтрокаДата.ИмяКолонки];
				КонецЦикла;
				СтрокаДерева_Ресурс.КоличествоОбщее = КоличествоОбщее;
			КонецЦикла;
			
			ТаблицаИтоговПоСотруднику.Свернуть("ИмяКолонки", "Количество");
			Для Каждого СтрокаИтог Из ТаблицаИтоговПоСотруднику Цикл
				СтрокаДерева_Сотрудник[СтрокаИтог.ИмяКолонки] = СтрокаИтог.Количество;
			КонецЦикла;
			СтрокаДерева_Сотрудник.КоличествоОбщее = ТаблицаИтоговПоСотруднику.Итог("Количество");
			
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(мДеревоНазначений, "ДеревоНазначений");
		Возврат;
	КонецЕсли;
	
		
	ТаблицаИсполнителейИНазначений = ТаблицаНазначений.Выгрузить();
	
	ТаблСотрудников = ТаблицаИсполнителейИНазначений.Скопировать();
	ТаблСотрудников.Свернуть("Сотрудник, Должность");
		
	мДеревоНазначений = РеквизитФормыВЗначение("ДеревоНазначений", Тип("ДеревоЗначений"));
	
	мДеревоНазначений.Строки.Очистить();
	
	Для Каждого СтрСотрудник Из ТаблСотрудников Цикл
		СтрокаДерева_Сотрудник =  мДеревоНазначений.Строки.Добавить();
		
		ЗаполнитьЗначенияСвойств( СтрокаДерева_Сотрудник, СтрСотрудник);
		СтрокаДерева_Сотрудник.ИсполнительРабота = СтрСотрудник.Сотрудник;	
		МассивРесурсов = ТаблицаИсполнителейИНазначений.НайтиСтроки(Новый Структура("Сотрудник, Должность", СтрСотрудник.Сотрудник, СтрСотрудник.Должность));
		
		СтруктураИтоговПоСотруднику = ПолучитьСтруктуруДляИтогов();
		
		ИтогоПоСотруднику = 0;
		ТаблицаИтоговПоСотруднику = Новый ТаблицаЗначений;
		ТаблицаИтоговПоСотруднику.Колонки.Добавить("ИмяКолонки", Новый ОписаниеТипов("Строка"));
		ТаблицаИтоговПоСотруднику.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
		
		Для Каждого СтрокаРесурс Из МассивРесурсов цикл
			СтрокаДерева_Ресурс =  СтрокаДерева_Сотрудник.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДерева_Ресурс, СтрокаРесурс); 
			СтрокаДерева_Ресурс.ИсполнительРабота = СтрокаРесурс.Работа;
			
			Для Каждого СтрокаДата Из ТаблицаДнейНазначений Цикл
				СтруктураИтоговПоСотруднику[СтрокаДата.ИмяКолонки] = СтрокаРесурс[СтрокаДата.ИмяКолонки];
				ИтогоПоСотруднику = ИтогоПоСотруднику + СтруктураИтоговПоСотруднику[СтрокаДата.ИмяКолонки]; 
				НоваяСтрокаИтог = ТаблицаИтоговПоСотруднику.Добавить();
				НоваяСтрокаИтог.ИмяКолонки = СтрокаДата.ИмяКолонки; 
				НоваяСтрокаИтог.Количество = СтруктураИтоговПоСотруднику[СтрокаДата.ИмяКолонки];
			КонецЦикла;
			
		КонецЦикла;
		
		ТаблицаИтоговПоСотруднику.Свернуть("ИмяКолонки", "Количество");
		Для Каждого СтрокаИтога Из ТаблицаИтоговПоСотруднику Цикл
			СтрокаДерева_Сотрудник[СтрокаИтога.ИмяКолонки] = СтрокаИтога.Количество;
		КонецЦикла;
		СтрокаДерева_Сотрудник.КоличествоОбщее = ИтогоПоСотруднику;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(мДеревоНазначений, "ДеревоНазначений");
		
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруДляИтогов()
	
	СтруктураДляИтогов = Новый Структура();
	
	Для Каждого СтрокаДата Из ТаблицаДнейНазначений Цикл
		СтруктураДляИтогов.Вставить(СтрокаДата.ИмяКолонки, 0);
	КонецЦикла;
	
	Возврат СтруктураДляИтогов;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуНазначенийПриСменеТаблицы()
	
	мДеревоНазначений = РеквизитФормыВЗначение("ДеревоНазначений", Тип("ДеревоЗначений"));
	
	Для Каждого СтрокаСотрудник Из мДеревоНазначений.Строки Цикл
		Для Каждого СтрокаРесурс Из СтрокаСотрудник.Строки Цикл
			НоваяСтрока = ТаблицаНазначений.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаРесурс); 
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивИдентификаторовСтрокСОтборомПоРесурсуиСоставу(ИдентификаторСтроки)
	
	МассивИД = Новый Массив;
	
	ТекущаяСтрока = ТаблицаНазначений.НайтиПоИдентификатору(ИдентификаторСтроки);
	ОтборСтрок = Новый Структура("Работа, Ресурс, СоставРесурса", ТекущаяСтрока.Работа, ТекущаяСтрока.Ресурс, ТекущаяСтрока.СоставРесурса);
	
	МассивСтрок = ТаблицаНазначений.НайтиСтроки(ОтборСтрок);
	
	Для Каждого СтрокаМассива из МассивСтрок Цикл
		МассивИД.Добавить(СтрокаМассива.ПолучитьИдентификатор());
	КонецЦикла;
	
	Возврат МассивИД;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьЧасыИсполнителейПоТабелю(ИдентификаторСтроки)
	
	ТекущаяСтрока = ТаблицаНазначений.НайтиПоИдентификатору( ИдентификаторСтроки);
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 	
	
	Работа = ТекущаяСтрока.Работа; 
	СтруктураРаботы = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьПараметрыВыполненияРаботы(Работа,Перечисления.УСОERP_ВидыПланированияСтроительныхРабот.Календарный,Объект.ДатаОкончания,Истина);
	ДатаНачалаРаботы    =?(СтруктураРаботы.НачалоРаботыПлан = NULL,Дата(1,1,1), НачалоДня(СтруктураРаботы.НачалоРаботыПлан));
	ДатаОкончанияРаботы = ?(СтруктураРаботы.ОкончаниеРаботыПлан = NULL,Дата(1,1,1),КонецДня(СтруктураРаботы.ОкончаниеРаботыПлан));
	Если НовыйВариант Тогда
		ДатаНачалаРаботы = НачалоДня(Работа.ДатаНачала);
		ДатаОкончанияРаботы = КонецДня(Работа.ДатаОкончания);
	КонецЕсли;
	
	СписокСотрудников = Новый Массив;
	СписокСотрудников.Добавить(ТекущаяСтрока.Сотрудник);
	
	ВыборкаДанныхОВремени = Документы.УСОERP_НазначениеИсполнителейРабот.ДанныеОВремениСотрудников(Объект, СписокСотрудников);
	
	КоличествоОбщее = 0;
	
	Пока ВыборкаДанныхОВремени.СледующийПоЗначениюПоля("Сотрудник") Цикл
		
		Пока ВыборкаДанныхОВремени.СледующийПоЗначениюПоля("Дата") Цикл 								
			
			МассивСтрокДат = ТаблицаДнейНазначений.НайтиСтроки(Новый Структура("Дата", ВыборкаДанныхОВремени.Дата));			
			
			Если ВыборкаДанныхОВремени.Дата >= ДатаНачалаРаботы И ВыборкаДанныхОВремени.Дата<=ДатаОкончанияРаботы Тогда
				
				Если МассивСтрокДат.Количество() <> 0 Тогда 
					ИмяКолонки = МассивСтрокДат[0].ИмяКолонки;  								
					//- ДС Чабаненко
					//ТекущаяСтрока[ИмяКолонки] = ВыборкаДанныхОВремени.НормаЧасов; 	
					//+ ДС Чабаненко
					ТекущаяСтрока[ИмяКолонки] = ВыборкаДанныхОВремени.Часы; 	
					/// ДС Чабаненко
					КоличествоОбщее = КоличествоОбщее + ТекущаяСтрока[ИмяКолонки];
				КонецЕсли; 
				
			КонецЕсли;
			
		КонецЦикла;	   							
		
	КонецЦикла;	
	
	ТекущаяСтрока.КоличествоОбщее = КоличествоОбщее;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНазначенияПередУдалением(ИдентификаторСтроки)
	
	УдаляемаяСтрока = ДеревоРабот.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если УдаляемаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиНазначений = ТаблицаНазначений.НайтиСтроки(Новый Структура("Работа, Ресурс, СоставРесурса, ИдентификаторДляПоиска", УдаляемаяСтрока.Работа, УдаляемаяСтрока.Ресурс, УдаляемаяСтрока.СоставРесурса, УдаляемаяСтрока.ИдентификаторДляПоиска)); 	
	Для Каждого мСтрокаКУдалению Из СтрокиНазначений Цикл
		ТаблицаНазначений.Удалить(мСтрокаКУдалению);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДокументУтвержденияПриИзмененииНаСервере()
	НовыйВариант = Объект.ДокументУтверждения.СценарийПланирования.НовыйВариант = Истина;
	Объект.НаправлениеДеятельности = Объект.ДокументУтверждения.НаправлениеДеятельности;
КонецПроцедуры

&НаКлиенте
Процедура ДокументУтвержденияПриИзменении(Элемент)
	ДокументУтвержденияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДокументУтвержденияОчистка(Элемент, СтандартнаяОбработка)
	ДокументУтвержденияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

// СтандартныеПодсистемы.Свойства 
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()

	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);

КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства 

#КонецОбласти
